Vasconcelos_Wright_2011_Geysering/caseB_Dt12p7_Ha0610_Yfs0356/openfoam_2d_caseB/0.orig/alpha.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}
