Vasconcelos_Wright_2011_Geysering/caseB_Dt12p7_Ha0610_Yfs0356/openfoam_2d_caseB/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 105271.3;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 105271.3;
    }

    atmosphere
    {
        type            calculated;
        value           uniform 101325;
    }

    frontAndBack
    {
        type            empty;
    }
}
