Vasconcelos_Wright_2011_Geysering/caseB_Dt12p7_Ha0610_Yfs0356/openfoam_2d_caseB/0.orig/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 105271.3;

boundaryField
{
    walls
    {
        type            fixedFluxPressure;
    }

    atmosphere
    {
        type            fixedValue;
        value           uniform 101333;
    }

    frontAndBack
    {
        type            empty;
    }
}
