Vasconcelos_Wright_2011_Geysering/caseB_Dt12p7_Ha0610_Yfs0356/openfoam_2d_caseB/Allrun.smoke
#!/bin/bash
cd "$(dirname "$0")"
CASE_DIR="$PWD"

source /usr/share/modules/init/bash 2>/dev/null || true
source /usr/lib/openfoam/openfoam2512/etc/bashrc
set -euo pipefail

TMP_CASE="$(mktemp -d "${TMPDIR:-/tmp}/caseB-smoke.XXXXXX")"
cleanup()
{
    if [[ "${KEEP_SMOKE_CASE:-0}" == "1" ]]; then
        echo "Smoke case retained at: $TMP_CASE"
    else
        rm -rf "$TMP_CASE"
    fi
}
trap cleanup EXIT

cp -a "$CASE_DIR/0.orig" "$CASE_DIR/constant" "$CASE_DIR/system" "$TMP_CASE/"
cd "$TMP_CASE"
cp -a 0.orig 0

foamDictionary system/controlDict -entry endTime -set 0.02 >/dev/null
foamDictionary system/controlDict -entry writeInterval -set 0.01 >/dev/null

blockMesh > log.blockMesh 2>&1
checkMesh -allTopology -allGeometry > log.checkMesh 2>&1
setFields > log.setFields 2>&1
compressibleInterFoam > log.compressibleInterFoam 2>&1

latest="$(foamListTimes -latestTime)"
echo "CASE_B_SMOKE_DONE endTime=${latest} temporaryCase=${TMP_CASE}"
