Vasconcelos_Wright_2011_Geysering/caseB_Dt12p7_Ha0610_Yfs0356/openfoam_2d_caseB/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    div(phi,alpha)      Gauss vanLeer;
    div(phirb,alpha)    Gauss linear;

    div(rhoPhi,U)       Gauss upwind;
    div(rhoPhi,T)       Gauss upwind;
    div(rhoPhi,K)       Gauss upwind;
    div(phi,p)          Gauss upwind;
    div(phi,k)          Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear uncorrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             uncorrected;
}
