Vasconcelos_Wright_2011_Geysering/caseB_Dt12p7_Ha0610_Yfs0356/openfoam_2d_caseB/system/towerProbeLocations
(3.516 0.049 0)
(3.516 0.054 0)
(3.516 0.059 0)
(3.516 0.064 0)
(3.516 0.069 0)
(3.516 0.074 0)
(3.516 0.079 0)
(3.516 0.084 0)
(3.516 0.089 0)
(3.516 0.094 0)
(3.516 0.099 0)
(3.516 0.104 0)
(3.516 0.109 0)
(3.516 0.114 0)
(3.516 0.119 0)
(3.516 0.124 0)
(3.516 0.129 0)
(3.516 0.134 0)
(3.516 0.139 0)
(3.516 0.144 0)
(3.516 0.149 0)
(3.516 0.154 0)
(3.516 0.159 0)
(3.516 0.164 0)
(3.516 0.169 0)
(3.516 0.174 0)
(3.516 0.179 0)
(3.516 0.184 0)
(3.516 0.189 0)
(3.516 0.194 0)
(3.516 0.199 0)
(3.516 0.204 0)
(3.516 0.209 0)
(3.516 0.214 0)
(3.516 0.219 0)
(3.516 0.224 0)
(3.516 0.229 0)
(3.516 0.234 0)
(3.516 0.239 0)
(3.516 0.244 0)
(3.516 0.249 0)
(3.516 0.254 0)
(3.516 0.259 0)
(3.516 0.264 0)
(3.516 0.269 0)
(3.516 0.274 0)
(3.516 0.279 0)
(3.516 0.284 0)
(3.516 0.289 0)
(3.516 0.294 0)
(3.516 0.299 0)
(3.516 0.304 0)
(3.516 0.309 0)
(3.516 0.314 0)
(3.516 0.319 0)
(3.516 0.324 0)
(3.516 0.329 0)
(3.516 0.334 0)
(3.516 0.339 0)
(3.516 0.344 0)
(3.516 0.349 0)
(3.516 0.354 0)
(3.516 0.359 0)
(3.516 0.364 0)
(3.516 0.369 0)
(3.516 0.374 0)
(3.516 0.379 0)
(3.516 0.384 0)
(3.516 0.389 0)
(3.516 0.394 0)
(3.516 0.399 0)
(3.516 0.404 0)
(3.516 0.409 0)
(3.516 0.414 0)
(3.516 0.419 0)
(3.516 0.424 0)
(3.516 0.429 0)
(3.516 0.434 0)
(3.516 0.439 0)
(3.516 0.444 0)
(3.516 0.449 0)
(3.516 0.454 0)
(3.516 0.459 0)
(3.516 0.464 0)
(3.516 0.469 0)
(3.516 0.474 0)
(3.516 0.479 0)
(3.516 0.484 0)
(3.516 0.489 0)
(3.516 0.494 0)
(3.516 0.499 0)
(3.516 0.504 0)
(3.516 0.509 0)
(3.516 0.514 0)
(3.516 0.519 0)
(3.516 0.524 0)
(3.516 0.529 0)
(3.516 0.534 0)
(3.516 0.539 0)
(3.516 0.544 0)
(3.516 0.549 0)
(3.516 0.554 0)
(3.516 0.559 0)
(3.516 0.564 0)
(3.516 0.569 0)
(3.516 0.574 0)
(3.516 0.579 0)
(3.516 0.584 0)
(3.516 0.589 0)
(3.516 0.594 0)
(3.516 0.599 0)
(3.516 0.604 0)
(3.516 0.609 0)
(3.516 0.614 0)
(3.516 0.619 0)
(3.516 0.624 0)
(3.516 0.629 0)
(3.516 0.634 0)
(3.516 0.639 0)
(3.516 0.644 0)
(3.516 0.649 0)
(3.516 0.654 0)
